> > Have you tested the provider using `scopes` locally?
> > I'm getting the below errors on this branch:
> > ```
> > ❯ terraform apply
> > ╷
> > │ Warning: Provider development overrides are in effect
> > │ 
> > │ The following provider development overrides are set in the CLI configuration:
> > │  - castai/castai in /Users/radosny/projects/terraform-provider-castai
> > │ 
> > │ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
> > ╵
> > ╷
> > │ Error: Missing required argument
> > │ 
> > │   on main.tf line 14, in resource "castai_role_bindings" "owner_test":
> > │   14:   scopes {
> > │ 
> > │ The argument "kind" is required, but no definition was found.
> > ╵
> > ╷
> > │ Error: Missing required argument
> > │ 
> > │   on main.tf line 14, in resource "castai_role_bindings" "owner_test":
> > │   14:   scopes {
> > │ 
> > │ The argument "resource_id" is required, but no definition was found.
> > ╵
> > ╷
> > │ Error: Unsupported block type
> > │ 
> > │   on main.tf line 15, in resource "castai_role_bindings" "owner_test":
> > │   15:     scope {
> > │ 
> > │ Blocks of type "scope" are not expected here.
> > ╵
> > ╷
> > │ Error: Unsupported block type
> > │ 
> > │   on main.tf line 19, in resource "castai_role_bindings" "owner_test":
> > │   19:     scope {
> > │ 
> > │ Blocks of type "scope" are not expected here.
> > ```
> > 
> > 
> >     
> >       
> >     
> > 
> >       
> >     
> > 
> >     
> >   
> > After modifying the resource definition it works:
> > ```go
> > 			FieldRoleBindingsScopes: {
> > 				Type:        schema.TypeList,
> > 				Optional:    true,
> > 				Description: "Scopes of the role binding.",
> > 				Elem: &schema.Resource{
> > 					Schema: map[string]*schema.Schema{
> > 						FieldRoleBindingsScope: {
> > 							Type:     schema.TypeList,
> > 							Optional: true,
> > 							Elem: &schema.Resource{
> > 								Schema: map[string]*schema.Schema{
> > 									FieldRoleBindingsScopeKind: {
> > 										Type:             schema.TypeString,
> > 										Required:         true,
> > 										Description:      fmt.Sprintf("Scope of the role binding Supported values include: %s.", strings.Join(supportedScopeKinds, ", ")),
> > 										ValidateDiagFunc: validation.ToDiagFunc(validation.StringInSlice(supportedScopeKinds, true)),
> > 										DiffSuppressFunc: func(k, oldValue, newValue string, d *schema.ResourceData) bool {
> > 											return strings.EqualFold(oldValue, newValue)
> > 										},
> > 									},
> > 									FieldRoleBindingsScopeResourceID: {
> > 										Type:        schema.TypeString,
> > 										Required:    true,
> > 										Description: "ID of the scope resource.",
> > 									},
> > 								},
> > 							},
> > 						},
> > 					},
> > 				},
> > 			},
> > ```
> > 
> > 
> >     
> >       
> >     
> > 
> >       
> >     
> > 
> >     
> >   
> > ```
> >  + resource "castai_role_bindings" "owner_test" {
> >       + description     = "Owner access for whole organization."
> >       + id              = (known after apply)
> >       + name            = "Role binding owner"
> >       + organization_id = "b2ca96cf-eb4b-4a01-94f7-05960536e48f"
> >       + role_id         = "3e1050c7-6593-4298-94bb-154637911d78"
> > 
> >       + scopes {
> >           + scope {
> >               + kind        = "organization"
> >               + resource_id = "b2ca96cf-eb4b-4a01-94f7-05960536e48f"
> >             }
> >           + scope {
> >               + kind        = "cluster"
> >               + resource_id = "a4b3c2d1-1234-5678-90ab-cdef01234567"
> >             }
> >         }
> > 
> >       + subjects {
> >           + subject {
> >               + group_id           = (known after apply)
> >               + kind               = "user"
> >               + service_account_id = (known after apply)
> >               + user_id            = "21c133e2-a899-4f51-b297-830bc62e51d6"
> >             }
> >           + subject {
> >               + group_id           = (known after apply)
> >               + kind               = "user"
> >               + service_account_id = (known after apply)
> >               + user_id            = "0d1efe35-7ecb-4821-a52d-fd56c9710a64"
> >             }
> >           + subject {
> >               + group_id           = "651734a7-0d0c-49f3-9654-dd92175febaa"
> >               + kind               = "group"
> >               + service_account_id = (known after apply)
> >               + user_id            = (known after apply)
> >             }
> >           + subject {
> >               + group_id           = (known after apply)
> >               + kind               = "service_account"
> >               + service_account_id = "3bf49513-3e9c-4a12-962c-af3bb1a85074"
> >               + user_id            = (known after apply)
> >             }
> >         }
> >     }
> > ```
> 
> you are right. The way I defined it, it should be used:
> 
> ```
> scopes {
>     kind        = "organization"
>     resource_id = data.castai_organization.test.id
>   }
> 
>   scopes {
>     kind        = "cluster"
>     resource_id = "11111111-1111-1111-1111-111111111111"
>   }
> ```
> 
> can I change the definition now? it will be a breaking change with what was already released, @radekska ?

Yes, we need to change this, as currently it doesn't work 